package com.notebook.exercise;

/**
 * 标准BFS
 * Created by luorigong on 2020-04-21.
 */
public class BFS {
  //标准BFS
  /**
   * void BFS()
   * {
   *     定义队列;
   *     定义备忘录，用于记录已经访问的位置；
   *
   *     判断边界条件，是否能直接返回结果的。
   *
   *     将起始位置加入到队列中，同时更新备忘录。
   *
   *     while (队列不为空) {
   *         获取当前队列中的元素个数。
   *         for (元素个数) {
   *             取出一个位置节点。
   *             判断是否到达终点位置。
   *             获取它对应的下一个所有的节点。
   *             条件判断，过滤掉不符合条件的位置。
   *             新位置重新加入队列。
   *         }
   *     }
   *
   * }
   */
}
